In [1]:
import pandas as pd
import numpy as np
import finance_func as ff

In [2]:
df = pd.read_csv('BYN_RC_F01_01_2005_T31_12_2018.csv')

In [3]:
df.head()

   nominal        data     curs                cdx
0        1  2018-12-30  32.0732  Белорусский рубль
1        1  2018-12-29  32.1935  Белорусский рубль
2        1  2018-12-28  32.0503  Белорусский рубль
3        1  2018-12-27  32.0805  Белорусский рубль
4        1  2018-12-26  32.1237  Белорусский рубль

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3472 entries, 0 to 3471
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   nominal  3472 non-null   int64
 1   data     3472 non-null   object
 2   curs     3472 non-null   float64
 3   cdx      3472 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 108.6+ KB

In [5]:
df['data'] = pd.to_datetime(df.data, format='%Y-%m-%d')

In [6]:
# Посмотрим волатильность курса за 2018 год
df_curs_2018 = df \
    .assign(year=df.data.dt.year) \
    .query('year==2018') \
    .sort_values('data', ascending=True)[['curs']] \
    .reset_index(drop=True)

In [7]:
s = pd.Series([20, 25, 27.2], name='TST')

In [8]:
s

0    20.0
1    25.0
2    27.2
Name: TST, dtype: float64

In [9]:
ff.change(s)

0      NaN
1    0.250
2    0.088
Name: TST, dtype: float64

In [10]:
df = pd.DataFrame({
    'TST0': [1.365, 1.352, 1.587],
    'TST1': [865.39, 901.12, 899.02],
    'TST2': [12.83, np.nan, 12.95]},
    index=['2022-01-01', '2022-01-02', '2022-01-03'])

In [11]:
df

             TST0    TST1   TST2
2022-01-01  1.365  865.39  12.83
2022-01-02  1.352  901.12    NaN
2022-01-03  1.587  899.02  12.95

In [12]:
ff.change(df)

                TST0      TST1      TST2
2022-01-01       NaN       NaN       NaN
2022-01-02 -0.009524  0.041288  0.000000
2022-01-03  0.173817 -0.002330  0.009353

### Функция изменчивости данных

```python
change_ln(data, periods=1)
```

Функция `change_ln` принимает на вход данные в формате `pd.DataFrame` или `pd.Series`. А на выходе возвращает информацию того же формата об изменчивости данных.

$$
\delta_{t} = \ln{\frac{V_{t}}{V_{t-1}}}
$$

С математической точки зрения, в отличие от функции `change`, логарифм показывает относительное изменение.

```
>>> s = pd.Series([28, 30, 28])
>>> ff.change(s)
0         NaN
1    0.071429
2   -0.066667
dtype: float64

>>> ff.change_ln(s)
0         NaN
1    0.068993
2   -0.068993
dtype: float64
```
Т.е. в первом случае стоимость финансового инструмента сначала выросла на 7.14%, а затем снизилась на 6.67%. Хотя конечная стоимость не отличается от первоначальной. А во втором случае наблюдается такая картина, что стоимость финансового инструмента сначала выросла на 6.7%, а затем снизилась также на 6.7%.

In [22]:
# Series example
s = pd.Series([28, 30, 28], name='TST')

In [23]:
s

0    28
1    30
2    28
Name: TST, dtype: int64

In [24]:
ff.change_ln(s)

0         NaN
1    0.068993
2   -0.068993
Name: TST, dtype: float64

In [25]:
# Series example
s = pd.Series([np.nan, 12, np.nan, np.nan, 12.5, 12.85, 12.83])

In [26]:
s

0      NaN
1    12.00
2      NaN
3      NaN
4    12.50
5    12.85
6    12.83
dtype: float64

In [27]:
ff.change_ln(s)

0         NaN
1         NaN
2    0.000000
3    0.000000
4    0.040822
5    0.027615
6   -0.001558
dtype: float64

In [30]:
# DataFrame example
df = pd.DataFrame({
    'TST1': [85, 86, 29],
    'TST2': [36.2, 37.8, 39.9],
    'TST3': [0.1685, np.nan, 0.1683]})

In [31]:
df

   TST1  TST2    TST3
0    85  36.2  0.1685
1    86  37.8     NaN
2    29  39.9  0.1683

In [32]:
ff.change_ln(df)

       TST1      TST2      TST3
0       NaN       NaN       NaN
1  0.011696  0.043250  0.000000
2 -1.087051  0.054067 -0.001188